In [1]:
import pandas as pd
import numpy as np

In [2]:
pd

In [11]:
temps = pd.Series([32, 25, 28, 75, 42], index=['New York', 'Seattle', 'San Francisco', 'Montreal', 'Chicago'])

In [15]:
temps.index

Index(['New York', 'Seattle', 'San Francisco', 'Montreal', 'Chicago'], dtype='object')

In [16]:
temps.min()

np.int64(25)

In [17]:
temps.max()

np.int64(75)

In [18]:
pd.Series(temps)

New York         32
Seattle          25
San Francisco    28
Montreal         75
Chicago          42
dtype: int64

In [ ]:
# create a series of daily temperatures with custom day labels
# create a series of daily precipitation values
# calculate the average temperature, the total precipitation
# find days where the temperature is > x and and the precipitation is < than y

In [19]:
df = pd.DataFrame(temps)

In [20]:
df

                0
New York       32
Seattle        25
San Francisco  28
Montreal       75
Chicago        42

In [22]:
df.shape

(5, 1)

In [23]:
df.head(1)

           0
New York  32

In [24]:
df.tail(3)

                0
San Francisco  28
Montreal       75
Chicago        42

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, New York to Chicago
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      int64
dtypes: int64(1)
memory usage: 252.0+ bytes

In [26]:
df.describe()

               0
count   5.000000
mean   40.400000
std    20.378911
min    25.000000
25%    28.000000
50%    32.000000
75%    42.000000
max    75.000000

In [28]:
df.iloc[[0,3]]

           0
New York  32
Montreal  75

In [29]:
df.iloc[3]

0    75
Name: Montreal, dtype: int64

In [36]:
df.max()

0    75
dtype: int64

In [37]:
df.min()

0    25
dtype: int64